In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
data={'Name': ['Alice', 'Bob','Charlie', 'David', 'Eva'],
'Age': [23, 25, 22, 24, 23],
'Gender': ['F','M', 'M', 'M', 'F'],
'Score': [85, 78, 92, 70, 88]}

In [4]:
df=pd.DataFrame(data)

In [5]:
df.head(3)

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92

In [6]:
df[df['Gender']=='F']

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [7]:
df['Score1']=df['Score']

In [8]:
df['Score2']=df['Score']

In [9]:
df

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [10]:
df['Age1']=df['Age']

In [11]:
df

      Name  Age Gender  Score  Score1  Score2  Age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [12]:
df=df.drop('Age1',axis=1)

In [13]:
df=df.drop(['Score1','Score2'],axis=1)

In [14]:
df

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [15]:
df.drop(3,axis=0)

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
4      Eva   23      F     88

In [16]:
df[(df['Gender']=='F') & (df['Score']>85)]

  Name  Age Gender  Score
4  Eva   23      F     88

In [17]:
df=df.sort_values('Score',ascending=False)

In [18]:
df

      Name  Age Gender  Score
2  Charlie   22      M     92
4      Eva   23      F     88
0    Alice   23      F     85
1      Bob   25      M     78
3    David   24      M     70

In [19]:
def grades(Score):
    if Score>=90:
        return'A'
    elif Score<90 and Score>=80:
        return'B'
    elif Score<80 and Score>=70:
        return'C'
    else:
        return 'D'

In [20]:
df['Grade']=df['Score'].apply(grades)

In [21]:
df

      Name  Age Gender  Score Grade
2  Charlie   22      M     92     A
4      Eva   23      F     88     B
0    Alice   23      F     85     B
1      Bob   25      M     78     C
3    David   24      M     70     C

In [22]:
df2=pd.DataFrame({
'Month': ['Jan', 'Feb', 'Mar','Jan', 'Feb', 'Mar'],
'Product': ['A', 'A', 'A', 'B', 'B', 'B'],
'Sales': [150, 200, 250, 300, 400, 500]
})

In [23]:
highest_sales=df2.groupby('Product')['Sales'].sum().reset_index()

In [24]:
highest_sales

  Product  Sales
0       A    600
1       B   1200

In [25]:
monthly_sales=df2.loc[df2.groupby('Product')['Sales'].idxmax()]

In [26]:
monthly_sales

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [30]:
df2['Sales_percentage']=df2['Sales']/df2['Sales'].sum()*100

In [31]:
df2

  Month Product  Sales  Sales_percentage
0   Jan       A    150          8.333333
1   Feb       A    200         11.111111
2   Mar       A    250         13.888889
3   Jan       B    300         16.666667
4   Feb       B    400         22.222222
5   Mar       B    500         27.777778

In [32]:
df3=pd.DataFrame({'Name': ['John', "Doe", "Jane", "Anna", "Smith"],
"Department": ['HR', 'Finance', None, 'IT', 'HR'],
"Salary": [50000, 60000, 55000, None, 58000]})

In [35]:
df3.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [36]:
department_mode = df3['Department'].mode()[0]

In [37]:
df3['Salary'].fillna(df3['Salary'].mean(), inplace=True)

In [38]:
df3

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [39]:
df3.dropna(inplace=True)

In [40]:
df3

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [41]:
temperature = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])

In [42]:
temperature.mean()

24.6

In [43]:
temperature.median()

24.5

In [44]:
temperature.std()

3.2041639575194445

In [45]:
temperature_celsius = (temperature - 32) * 5 / 9

In [46]:
temperature_celsius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [49]:
temperature.idxmax()

5

In [50]:
temperature.idxmin()

2

In [51]:
 temperature.sort_values()

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [52]:
temperature.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [53]:
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 103, 104, 101],
    'Product': ['A', 'B', 'A', 'C', 'B']
})

In [54]:
customers = pd.DataFrame({
    'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})

In [55]:
merged_df = pd.merge(orders, customers, on='CustomerID')

In [56]:
merged_df

   OrderID  CustomerID Product     Name     Location
0        1         101       A    Alice     New York
1        5         101       B    Alice     New York
2        2         102       B      Bob  Los Angeles
3        3         103       A  Charlie      Chicago
4        4         104       C    David      Houston

In [57]:
orders_by_location = merged_df.groupby('Location').size()

In [58]:
orders_by_location

Location
Chicago        1
Houston        1
Los Angeles    1
New York       2
dtype: int64